# ThermalProperties Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FloorType..::..ThermalProperties Property
FloorType Class See Also
---
The calculated and settable thermal properties of the FloorType
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ThermalProperties ThermalProperties { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
```

Visual C++
---
```text
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | the floor does not have thermal properties. |

# See Also
FloorType Class
Autodesk.Revit.DB Namespace